{
    "basics": {
      "name": "Larry Ludlow",
      "label": "Principal Engineer",
      "picture": "Larry.JPG",
      "email": "lludlow@gmail.com",
      "phone": "",
      "website": "",
      "summary": "A Detroit Metro Area senior Global or Enterprise level infrastructure architect setting and implementing direction that encourages new innovation and the pursuit of excellence. \n\nExpert in solution architecture, design, implementation and support of secure, high performance, scalable, globally distributed Internet connected data center environments, private and public cloud server infrastructure.\n\nUnique ability to step into an opportunity, assess the needs, rapidly identify possible solutions taking into account the “Big Picture” and doing whatever is required to accomplish win:win successes. Excels at building intelligent, common sense, loyal teams that exceed expectations. A problem solver and troubleshooter.\n",
      "location": {
        "city": "Livonia",
        "countryCode": "US",
        "region": "Michigan"
      },
      "profiles": [
        {
          "network": "LinkedIn",
          "username": "lludlow2",
          "url": "https://www.linkedin.com/in/lludlow2/"
        },
        {
          "network": "PDF Resume",
          "username": "Download PDF",
          "url": "https://larryludlow.com/Larry_Ludlow.pdf"
        }
      ]
    },
    "work": [
      {
        "company": "AccumTech",
        "endDate": "",
        "highlights": [
          "Lead the IT team in optimizing technology operations, including infrastructure management, network security, and database administration.",
          "Develop and implement IT policies and systems aligned with organizational strategies to enhance operational efficiency.",
          "Manage annual budget planning and resource allocation, ensuring cost-effective utilization of IT resources.",
          "Build and nurture vendor relationships to secure reliable IT services and solutions.",
          "Mentor and develop a high-performing IT team, fostering a culture of continuous learning and collaboration."
        ],
        "position": "IT Manager",
        "startDate": "2023-05-01",
        "summary": "As the IT Manager at Accumtech, I directed our IT team toward optimizing the entirety of our technology operations, which spanned from infrastructure management to network security and database administration. I was instrumental in crafting and applying IT policies that not only mirrored the company's strategic goals but also significantly enhanced operational efficiency",
        "website": "https://accumtech.com"
      },
      {
        "company": "Otava",
        "endDate": "2023-2-20",
        "highlights": [
          "Automate all the things to minimize human error.",
          "Built an ansible framework to manage cumulus network devices across multiple data centers.",
          "Created a highly available, distributed S3 offering to provide tier 3 storage to our customers.",
          "Provide Tier 3 support for customers and channel partners.",
          "MOP/SOP for front-line support and deployment teams so they can utilize ansible to reduce time to delivery/recovery",
          "Wrote training materials and held classes on ansible, gitlab, docker, and CI/CD practices.",
          "Developed ansible good practices to streamline new projects.",
          "Actively work with the product team to develop new offerings and improve existing.",
          "Built a lab to support the proliferation of automation within the organization.",
          "POC for vCloud director to better support multi-tenancy in our vmware environment.",
          "Integrated 3 client portals using a microservices backend architecture, substantially enhancing customer experience, and reducing billing man-hours by an estimated 95%.",
          "Headed a comprehensive infrastructure and process modernization initiative that established a new support desk and a fully integrated configuration management database (CMDB)."
        ],
        "position": "Principal Engineer / Manager / Director",
        "startDate": "2019-02-28",
        "summary": "As the Principal Engineer and Manager at Otava, I spearheaded a broad range of initiatives focused on advancing automation, enhancing infrastructure, and fostering an environment of continuous improvement.",
        "website": "https://www.otava.com"
      },
      {
        "company": "Little Caesars Pizza",
        "endDate": "2018-12-31",
        "highlights": [
          "Maintain CI/CD for all facets of online and mobile ordering.",
          "Develop ansible and terraform modules for maintenance and growth of our multi-cloud environment (MS Azure and Google cloud).",
          "Built a modular monitoring and metrics stack utilizing prometheus, influxdb, grafana, alertmanager in a container environment to scale as needed.",
          "Configured federation between monitoring systems in each virtual environment (VPC).",
          "Created predictive algorithms to alert on potential problems before they happen.",
          "Built a container environment to host .netCore applications with auto-scaling to provide cost savings over a standard machine deployment.",
          "Built several proof of concepts to manage remote store systems (15,000+). Most of these utilized ansible to perform the configuration with a higher level orchestration (salt, puppet, foreman)",
          "Wrote an ESB consumer and dispatcher in Python to replace windows based services.",
          "Committed upstream fixes to several open source products we utilize.",
          "Developed a python based service to scrape metrics from our cloud providers and expose them to a metrics endpoint for prometheus consumption."
        ],
        "position": "Site Reliability Engineer",
        "startDate": "2018-03-31",
        "summary": "I played a pivotal role in enhancing the reliability and efficiency of online and mobile ordering systems through the maintenance and improvement of continuous integration and delivery processes. My work focused on scaling our operations within a multi-cloud environment and advancing our monitoring capabilities, ensuring preemptive problem identification and cost-effective resource utilization. Furthermore, I led innovative projects to improve remote system management across thousands of store locations and contributed to the refinement of our operational and monitoring frameworks.",
        "website": "https://littlecaesars.com"
      },
      {
        "company": "North American Bancard",
        "endDate": "2018-03-31",
        "highlights": [
          "Responsible for all Linux servers in a multi-company environment. Systems include Ubuntu, CEntOS, and Redhat Enterprise Linux.",
          "Managed automated builds and deployments using Stash and Bamboo.",
          "Automated deployments to AWS using bamboo and docker.",
          "Built a configuration management system using Ansible to deploy, configure, and ensure against configuration drift. I have also developed many other ansible plays for inventory collection, patching, and PCI remediation. Additionally, I wrote plugins to send status of each of these to our central logging system.",
          "Developed a centralized log management system using Logstash, Elasticsearch, Kabana, and HAProxy to provide a highly available and scalable method of collecting logs from our servers, infrastructure, and applications.",
          "Implemented a server monitoring system and integrated it with our alerting system and slack.",
          "Built a server and application metrics dashboard using Graphite, Grafana, and collectd. This has enabled dev, ops, and support people to see historic system metrics and better troubleshoot servers and applications."
        ],
        "position": "Sr. Linux Engineer",
        "startDate": "2016-09-30",
        "summary": "As the Senior Linux Engineer at North American Bancard, I oversaw all Linux servers across the organization, ensuring seamless operation within a complex multi-company setup. My role emphasized the automation of builds and deployments, the construction of a robust configuration management system to maintain server efficiency, and the implementation of a comprehensive log management solution to ensure high availability and scalability of server, infrastructure, and application log collection. Additionally, I spearheaded the development of server monitoring and application metrics dashboards, significantly improving the capability of development, operations, and support teams to diagnose and troubleshoot system and application issues effectively.",
        "website": "https://www.northamericanbancard.com/"
      },
      {
        "company": "The Auto Club Group",
        "endDate": "2016-06-30",
        "highlights": [
          "Managed a $13MM budget across staffing, licensing, projects, and resources.",
          "Directed a $3MM data center migration following a company acquisition.",
          "Cut costs by negotiating better licensing agreements with vendors.",
          "Reduced server deployment time from a matter of weeks to days.",
          "Deployed SCCM to facilitate deployment review and approval processes.",
          "Promoted from team leader to manager."
        ],
        "position": "Manager, Server Engineering",
        "startDate": "2012-09-30",
        "summary": "As Manager of Server Engineering at The Auto Club Group, I led the strategic planning, organization, and direction of server infrastructure services, ensuring robust IT security, audit compliance, and efficient disaster recovery processes. My responsibilities included managing key technology vendor relationships, overseeing contract negotiations, and providing technical oversight across diverse IT projects.",
        "website": "https://aaa.com"
      },
      {
        "company": "University of Michigan Health System",
        "endDate": "2012-09-30",
        "highlights": [
          "Provide support for large multi-location enterprise Linux deployment consisting of 200+ Suse Linux Enterprise Servers, 30+ RedHat Servers, 20 Open Enterprise Servers, and a small mix of Netware and Solaris servers.",
          "Create and maintain server provisioning, build process, and version control for all Linux distributions that we support.",
          "Provide strategic planning and Project management for the Linux team.",
          "Implemented Enterprise NTP time services.",
          "Implemented Veritas Clustering and Storage foundation in order to reduce the number of storage management tools and improve overall performance and availability.",
          "Tested and reviewed products to provide enterprise log aggregation and search functions.",
          "Provided direction and a single point of contact for a large data center migration/consolidation project that involved physically moving 150+ servers from an older, outdated data center to our newly built state-of-the-art data center.",
          "In charge of vendor relationships, product renewals, and purchases for the Linux team."
        ],
        "position": "Linux Team Lead",
        "startDate": "2008-01-31",
        "summary": "As Team Lead for Linux Engineering at the University of Michigan Health System, I guided the support and strategic development of a substantial multi-location enterprise Linux deployment, encompassing over 250 servers across various distributions. My duties included creating and maintaining server provisioning and build processes, strategic planning, and project management within the Linux team. I successfully implemented critical infrastructure improvements such as Enterprise NTP services and Veritas Clustering, enhancing performance and availability. I led a significant data center migration and consolidation project, which involved moving more than 150 servers to a new, modern facility",
        "website": "https://med.umich.edu/"
      },
      {
        "company": "INCAT",
        "endDate": "2008-01-31",
        "highlights": [
          "Upgraded 90+ Solaris servers in multiple locations worldwide to version 10 for Nissan USA.",
          "Installed and upgraded websphere application servers, WebSphere MQ servers, and WebSphere Portal servers to the latest version on 30 Solaris servers for Nissan USA.",
          "Built a Redhat server infrastructure to support FEA analysis portals for GE Aerospace/MSC Software.",
          "Deployed and configured clustering for JBoss application servers at GE Aerospace/MSC Software.",
          "Provided development support for engineering staff at GE Aerospace while developing a FEA portal while at MSC Software.",
          "Lead engineer for the development and integration project of the MSC software suite while at MSC software / GE Aerospace."
        ],
        "position": "Engineering Consultant",
        "startDate": "2007-09-30",
        "summary": "Implemented large-scale server (Solaris/JBoss) deployments for major companies in the aerospace and automotive sectors.",
        "website": ""
      },
      {
        "company": "Budco Inc.",
        "endDate": "2007-09-30",
        "highlights": [
          "Lead Engineer on a 'Fork Lift' Infrastructure upgrade (Solaris to Linux).",
          "Implemented an internal update server (yum) and custom compile rpm's from source to meet our specific needs.",
          "Compile RedHat Cluster Suite and GFS kernels from source to provide us with a cost-effective method of OS-level clustering and shared filesystems.",
          "Assist with the installation and configuration of Oracle 10g RAC clusters.",
          "Implemented a clustered JBoss AS environment (F5 Load balancers in front of an Apache web farm using mod_jk).",
          "Migrated all local users and service accounts to a Highly Available LDAP directory server that synchronizes users' passwords with Active Directory.",
          "Provide Linux training to DB and Systems administration teams.",
          "Designed an Open source monitoring system that complements our existing Compuware Monitoring Suite and displays server health on a graphical representation of our network."
        ],
        "position": "Linux / Unix Systems Engineer",
        "startDate": "2006-03-31",
        "summary": "Led and supported infrastructure upgrades including Solaris to Linux migrations, installation of Oracle RAC clusters and workload monitoring systems.",
        "website": ""
      },
      {
        "company": "Subether Networks",
        "endDate": "2012-01-31",
        "highlights": [],
        "position": "President and IT Consultant",
        "startDate": "1997-03-31",
        "summary": "Founder and IT Consultant of an IT consultancy that served clients in many industries, from the public sector to automotive and aerospace.",
        "website": "https://subethernetworks.com/"
      }
    ],
    "volunteer": [
      {
        "organization": "Open Management Consortium",
        "position": "Open Source Advocate",
        "website": "",
        "startDate": "2005-12-31",
        "endDate": "2009-12-31",
        "summary": null,
        "highlights": []
      }
    ],
    "education": [
      {
        "institution": "Western Goverenors University",
        "area": "Information Technology Management",
        "studyType": "Bachelor",
        "startDate": "2021",
        "endDate": "",
        "gpa": "",
        "courses": []
      },
      {
        "institution": "Eidgenössische Technische Hochschule Zürich",
        "area": "Computing: Art, Magic, Science",
        "studyType": "",
        "startDate": "2014-12-31",
        "endDate": "2014-12-31",
        "gpa": "",
        "courses": []
      },
      {
        "institution": "Duke University",
        "area": "Reasoning, Data Analysis and Writing",
        "studyType": "",
        "startDate": "2014-12-31",
        "endDate": "2015-12-31",
        "gpa": "",
        "courses": []
      },
      {
        "institution": "IE Business School",
        "area": "Critical Perspectives on Management",
        "studyType": "",
        "startDate": "2014-12-31",
        "endDate": "2014-12-31",
        "gpa": "",
        "courses": []
      },
      {
        "institution": "Massachusetts Institute of Technology",
        "area": "Supply Chain Fundamentals",
        "studyType": "",
        "startDate": "2014-12-31",
        "endDate": "2014-12-31",
        "gpa": "",
        "courses": []
      },
      {
        "institution": "David Chinsky & Associates",
        "area": "The Institute for Leadership Fitness™",
        "studyType": "",
        "startDate": "2010-12-31",
        "endDate": "2011-12-31",
        "gpa": "",
        "courses": []
      },
      {
        "institution": "Novell Advanced Technical Training",
        "area": "Certifications",
        "studyType": "",
        "startDate": "2009-12-31",
        "endDate": "2011-12-31",
        "gpa": "",
        "courses": [
            "Novell Certified Linux Engineer",
            "Advanced Linux Troubleshooting and Optimization",
            "Novell Zenworks Administrator"
        ]
      },
      {
        "institution": "HP",
        "area": "HP BladeSystems",
        "studyType": "",
        "startDate": "2010-12-31",
        "endDate": "2010-12-31",
        "gpa": "",
        "courses": [
            "Virtual Connect",
            "Boot-from-SAN",
            "BladeSystem Administration"
        ]
      },
      {
        "institution": "Symantec",
        "area": "Administration",
        "studyType": "",
        "startDate": "2006-12-31",
        "endDate": "2010-12-31",
        "gpa": "",
        "courses": [
            "Storage Foundation + HA 5.0",
            "Netbackup 6.x Administration",
            "Netbackup 6.x Troubleshooting"
        ]
      },
      {
        "institution": "Univerity of Michigan",
        "area": "Lean Healthcare Management",
        "studyType": "",
        "startDate": "2009-12-31",
        "endDate": "2009-12-31",
        "gpa": "",
        "courses": []
      },
      {
        "institution": "RedHat",
        "area": "Certifications",
        "studyType": "",
        "startDate": "2004-12-31",
        "endDate": "2009-12-31",
        "gpa": "",
        "courses": [
            "RHCJA",
            "RHCE 5",
            "RHCE 4"

        ]
      },
      {
        "institution": "Oakland University",
        "area": "Computer Science",
        "studyType": "",
        "startDate": "1998",
        "endDate": "2000",
        "gpa": "",
        "courses": []
      }
    ],
    "awards": [],
    "publications": [
      {
        "name": "Containers: Pros, Cons and How to Mitigate Risk",
        "publisher": "Container Journal",
        "releaseDate": "2020-01-07",
        "website": "https://containerjournal.com/topics/container-ecosystems/containers-pros-cons-and-how-to-mitigate-risk/",
        "summary": ""
      }
    ],
    "skills": [
      {
        "name": "Linux / Unix",
        "level": "",
        "keywords": [
            "Redhat",
            "Ubuntu",
            "Suse",
            "AIX",
            "Solaris"
        ]
      },
      {
        "name": "Virtualization",
        "level": "",
        "keywords": [
            "vmware",
            "vCloud Director",
            "KVM",
            "Proxmox",
            "PowerVM"
        ]
      },
      {
        "name": "DevOps",
        "level": "",
        "keywords": [
            "Puppet",
            "Ansible",
            "SaltStack",
            "Terraform",
            "Argo",
            "Flux",
            "Helm"
        ]
      },
      {
        "name": "Languages",
        "level": "",
        "keywords": [
            "Python",
            "golang",
            "PHP",
            "Java",
            "C++",
            "Rust"
        ]
      },
      {
        "name": "Cloud",
        "level": "",
        "keywords": [
            "AWS",
            "Azure",
            "Google Cloud"
        ]
      },
      {
        "name": "Containers",
        "level": "",
        "keywords": [
            "K8S",
            "Rancher",
            "Docker",
            "Docker Swarm"
        ]
      }
    ],
    "languages": [],
    "interests": [],
    "references": [
      {
        "name": "Larry Dragich",
        "reference": "Larry is an outstanding technical resource supporting Linux / Unix, adept at coming up with creative solutions to any technical problem that arises.  He also displays a very calm demeanor and remains that way in high pressure situations working against tight deadlines and when making presentations to Sr. IT Leadership. "
      },
      {
        "name": "Scott Burgess, PMP, ITIL",
        "reference": "I’ve had the pleasure of knowing Larry during his time at The Auto Club Group.  Larry is well versed across multiple technical disciplines. He’s proven his capabilities many times while working together on several projects. "
      },
      {
        "name": "Frank Remski",
        "reference": "I enjoyed working with Larry during his time at ACG.  He was always approachable, positive and results oriented.  Supporting mission critical technology is stressful by nature, but Larry was one of those people who could be counted on to roll up his sleeves and do whatever was necessary to solve problems."
      },
      {
        "name": "Sivakumar Ramarajan",
        "reference": "I'm glad that I had a chance to work with Larry at UM for 4 years. He was technical strong and was instrumental in implementing new technologies like puppet, Munin and SMT to manage our servers better. \r\n\r\nHe was really fun to work with and always to willing to help and impart his technical skills to me and the group."
      },
      {
        "name": "Merdi Zonooz",
        "reference": "Mr. Larry Ludlow is an asset to any organization due to his deep knowledge in Linux / UNIX in addition to his unlimited understand and capability in design and architecture of open source software. Larry is articulate, detail oriented, very efficient and by all means he is all about customer satisfaction.   Larry strives in bringing new innovations and his solutions to the IT challenges are thoughtful and intelligent.\r\nLarry has a very friendly personality and he gets along with everyone. His sense of responsibility and taking ownership of the problems and issues makes him a breath of fresh air to deal with."
      },
      {
        "name": "Darren Cooley",
        "reference": "Larry is a very knowledgeable and well rounded technologist. I worked with him while on the Linux team, and learned a great deal from him. I believe that he would be a valuable asset to any company's team."
      },
      {
        "name": "Beth Pumo, MBA, CISA, CISM, CISSP",
        "reference": "Larry has been an exceptional member of the Linux team at UMHS/MCIT.   He demonstrates a willingness to share his knowledge without reserve, which is sometimes rare in this day and age, and has proven himself to be technically strong.    Larry's attention to customer service, and his responsiveness to the needs of not only his customer base but also his peers has been very valuable."
      }
    ]
  }
